app/models/task_comment.rb

SELECT 1 AS one FROM "memberships" WHERE "memberships"."user_id" = 1 AND "memberships"."organization_id" = 1 LIMIT 1
---
  def author_has_membership
    return if author_id.blank?

    organization_id = task&.project&.organization_id
    return if organization_id.blank?
    return if Membership.exists?(user_id: author_id, organization_id:)