app/models/task.rb

SELECT 1 AS one FROM "memberships" WHERE "memberships"."user_id" = 1 AND "memberships"."organization_id" = 1 LIMIT 1
---
  def creator_has_membership
    return if creator_id.blank? || project.blank?
    return if Membership.exists?(user_id: creator_id, organization_id: project.organization_id)

SELECT 1 AS one FROM "memberships" WHERE "memberships"."user_id" = 2 AND "memberships"."organization_id" = 1 LIMIT 1
---
  def assignee_has_membership
    return if assignee_id.blank? || project.blank?
    return if Membership.exists?(user_id: assignee_id, organization_id: project.organization_id)